/** Global Configs */
window.configs = {
  websocket: "ws://172.23.57.52:9999/gis/gis/websocket/client", //人员定位数据websocket地址
  floorToName: {
    "1楼_室内": {
      "4c": {
        name: "中心数据机房",
        camera: { x: -52.59403393769559, y: 40.185278671027575, z: -18.23082781778644},
        controls: { x: -43.255908233557705, y: 17.182562343385925, z: -35.358902850814026 }
      },
    },
    "2楼_室内": {
      "2-1c": {
        name: "无线发射机房",
        camera: {x: -19.582923413771606, y: 23.56265938148471, z: -37.60114680776515},
        controls: { x: -3.369440073916503, y: 4.880416737013159, z: -44.748888231816274 },
      },
      "1-1c": {
        name: "UPS机房",
        camera: { x: -14.44290995550116, y: 14.80718449474303, z: -43.654289833725336 },
        controls: { x: -6.110428619416785, y: 3.681323985439594, z: -47.488730349617796 },
      },
    },
    柴油发电机房_室内: {
      "1c": {
        name: "柴油发电机房",
        camera: {x: -10.946060683115174, y: 16.862406744229947, z: -23.957917812635372 },
        controls: { x: -4.394365822733983, y: 4.110118586269645, z: -26.724374294253664}
      },
    },
  },
};
window.floorToName = {
  中心数据机房: {
    path: "inDoor/1楼_室内",
    floor: "4c",
  },
  无线发射机房: {
    path: "inDoor/2楼_室内",
    floor: "2-1c",
  },
  UPS机房: {
    path: "inDoor/2楼_室内",
    floor: "1-1c",
  },
  柴油发电机房: {
    path: "inDoor/柴油发电机房_室内",
    floor: "1c",
  },
};
